Revit 2027 API
Entity.IsValid Method
 Checks whether this Entity has a live Schema corresponding to it.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValid()
Public Function IsValid As Boolean
public:
bool IsValid()
member IsValid : unit -> bool
Return Value
Boolean
 True if the Entity is valid.
Remarks
 Invalid entities may be used as token values. E.g., setting an invalid subentity is equivalent to deleting the stored one.
See Also
Reference
Entity Class
Autodesk.Revit.DB.ExtensibleStorage Namespace